# yolov8-custom.yaml

# Parameters
nc: 80 # Number of classes for Pascal VOC

# Model scaling parameters
scales:
  # [depth, width, max_channels]
  n: [1, 1, 1024] # Adjusted to match backbone output

# Backbone configuration
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DinoV2Patches, [384, 'small']] # Outputs 384 channels

  # Other backbones available
  # - [-1, 1, DinoV2Patches, [768, 'base']] # Outputs 768 channels
  # - [-1, 1, DinoV2Patches, [1024, 'large']] # Outputs 1024 channels
  # - [-1, 1, DinoV2Patches, [1536, 'giant']] # Outputs 1536 channels

  # dinov3
  # - [-1, 1, DinoV2Patches, [1536, 'dinov3_convnext_large']] # Outputs 1536 channels (patch_size=14)
  # - [-1, 1, DinoV2Patches, [384, 'dinov3_vits16']] # Outputs 384 channels (patch_size=16)
  # - [-1, 1, DinoV2Patches, [4096, 'dinov3_vit7b16']] # Outputs 4096 channels (patch_size=16)
  # - [-1, 1, DinoV2Patches, [1280, 'dinov3_vith16plus']] # Outputs 1280 channels (patch_size=16)
  


# Head configuration
head:
  # [from, repeats, module, args]
  - [[-1], 1, Detect, [nc]] # 8: Detect layer 

